app/views/tasks/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :カテゴリ %><br>
    <%= f.collection_select :category_id, Category.all, :id, :name %>