app/views/tasks/index.html.erb

        <td><%= task.check %></td>
        <td><%= Category.find(task.category_id).name %></td>
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]