app/views/tasks/show.html.erb

SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
  <strong>カテゴリ:</strong>
  <%= Category.find(@task.category_id).name %>