app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("category_id", "check", "created_at", "deadline", "description", "start", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = 1  [["description", "清美たそが遅れるとおこだよ!!!!!!!!!!"], ["updated_at", "2014-06-26 08:00:05.843618"]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)